package Leetcode;

/*В данной задаче требуется удалить повторяющиеся элементы из упорядоченного по неубыванию массива целых чисел nums
 таким образом, чтобы каждый уникальный элемент встречался не более двух раз. Относительный порядок элементов должен
  быть сохранен.

Поскольку в некоторых языках невозможно изменить длину массива, результат должен быть помещен в начало массива nums.
 Формально, если после удаления дубликатов остается k элементов, то первые k элементов массива nums должны содержать
  конечный результат. Неважно, что находится за пределами первых k элементов.

Функция должна вернуть значение k после размещения конечного результата в первых k слотах массива nums.

Не выделяйте дополнительное пространство для другого массива. Задачу необходимо решить путем модификации входного массива nums на месте с использованием O(1) дополнительной памяти.*/
public class RemoveDuplicates {
    public static void main(String[] args) {
    }
}
